brew 'mise' 
brew 'bat'
brew 'shellcheck' 
brew 'starship' #shell
brew 'rbw' #bitwarden
brew 'libyaml' #for ruby
brew 'zellij'
brew 'lazydocker' 
#lazyvim starts
brew 'tree-sitter-cli'
brew 'lazygit'
brew 'neovim'
brew 'lua'
brew 'luarocks'
brew 'fzf'
brew 'ripgrep'
brew 'fd'


# Ohhh looovely font
cask 'font-maple-mono-nf' #for code
cask "font-rubik" #for system (KDE)
 
flatpak 'org.telegram.desktop'
flatpak 'dev.vencord.Vesktop'
flatpak 'io.anytype.anytype' #private space
flatpak 'md.obsidian.Obsidian' #open space
flatpak 'com.protonvpn.www' 
 
flatpak 'it.mijorus.gearlever'
flatpak 'com.github.tchx84.Flatseal'
flatpak 'io.github.flattool.Warehouse'
flatpak 'io.github.kolunmi.Bazaar'
flatpak 'io.github.flattool.Ignition'
flatpak 'com.github.marhkb.Pods'
